package com.dmdev.junit;

import com.dmdev.junit.extension.GlobalExtension;
import org.junit.jupiter.api.extension.ExtendWith;

// в основном мы исп. уже существующие в junit extension-ы (и-сы, которые позволяют доб. доп. функционал
// к тестам - напр., вставку каких-то методов в разн. места жизнен. цикла тестов) - но также можно
// написать и свои, когда хотим предоставить какой-то функционал или общ. базов. класс для всех тестов -
// для этого можно созд. свой какой-то тестов. базов. класс (мы его как раз создали и сейчас находимся
// в нем - TestClass) - и заикстендить туда любые extension, которые хотим - если унаследуемся
// от TestBase, то все наследники тоже унаследуют эти extension, которые в ан-и @ExtendWidth -
// т. е., резюмируя, можно сказать, что таким образом удобно писать свои extension, чтобы привнести
// какой-то общ. функционал, общ. поведение для всех тестов в проекте
@ExtendWith({
        GlobalExtension.class
})
public abstract class TestBase {

}
